Open_Foam/Simulation_Src/version_3.0+/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0.141 0.0 0.0);

boundaryField
{
    bottom_wall_outlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0);
    }

    bottom_wall_inlet
    {
        type            fixedValue;
        value           uniform ( 0 0 0);
    }

    top_wall
    {
        type            fixedValue;
        value           uniform ( 0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0.141 0 0);
    }

    frontAndBackPlanes
    {
        type            empty;
    }

}
