Open_Foam/Simulation_Src/version_3.0+/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    bottom_wall_outlet
    {
        type            zeroGradient;
    }

    bottom_wall_inlet
    {
        type            zeroGradient;
    }

    top_wall
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;

    }

    inlet
    {
        type            zeroGradient;
    }

    frontAndBackPlanes
    {
        type            empty;
    }

}
